krogla/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forceCoeffs
    {
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    10;

    log             yes;

    patches         (trup);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;           // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (0 1 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (1 0 0);
    magUInf         10;
    lRef            4.8;        // Wheelbase length
    Aref            0.44;        // frontal area
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
		
    }
	
	yPlus
    {
    type            yPlus;

    libs            ("libfieldFunctionObjects.so");
	patches         (trup);

    writeControl    timeStep;
    timeInterval    20;

    log             yes;
	
	rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;           // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (0 1 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (1 0 0);
    magUInf         10;
    lRef            4.8;        // Wheelbase length
    Aref            0.44;        // frontal area
	}
}


// ************************************************************************* //
